package dp

/****

一条包含字母 A-Z 的消息通过以下映射进行了 编码 ：

'A' -> "1"
'B' -> "2"
...
'Z' -> "26"
要 解码 已编码的消息，所有数字必须基于上述映射的方法，反向映射回字母（可能有多种方法）。例如，"11106" 可以映射为：

"AAJF" ，将消息分组为 (1 1 10 6)
"KJF" ，将消息分组为 (11 10 6)
注意，消息不能分组为  (1 11 06) ，因为 "06" 不能映射为 "F" ，这是由于 "6" 和 "06" 在映射中并不等价。

给你一个只含数字的 非空 字符串 s ，请计算并返回 解码 方法的 总数 。

题目数据保证答案肯定是一个 32 位 的整数。



示例 1：

输入：s = "12"
输出：2
解释：它可以解码为 "AB"（1 2）或者 "L"（12）。
示例 2：

输入：s = "226"
输出：3
解释：它可以解码为 "BZ" (2 26), "VF" (22 6), 或者 "BBF" (2 2 6) 。
示例 3：

输入：s = "06"
输出：0
解释："06" 无法映射到 "F" ，因为存在前导零（"6" 和 "06" 并不等价）。
 */

/***

正着，和倒着，都行，
下面的写法是倒着的
	f[i] = f[i+1] + f[i+2]  // if n[i]  and n[i,i+1] 是合法的。
 */
func numDecodings(s string) int {
	n := len(s)

	f := make([]int, n+1)
	if s[n-1] != '0' {
		f[n-1] = 1
	}
	if n >= 2 && s[n-2] != '0' {
		td := (s[n-2]-'0')*10 + s[n-1] - '0'
		if td <= 26 {
			f[n-2] = 1 + f[n-1]
		} else {
			f[n-2] = 1
		}
	}

	for i := n - 3; i >= 0; i-- {
		if s[i] != '0' {
			f[i] += f[i+1]
		}
		td := (s[i]-'0')*10 + s[i+1] - '0'
		if td <= 26 && td >= 10 {
			f[i] += f[i+2]
		}
	}
	return f[0]
}
